[
	{
		"name": "Ensure oslogin is enabled for a Project",
		"description": "Enabling OS login binds SSH certificates to IAM users and facilitates effective SSH certificate management.",
		"testCaseId": "COMPUTE_VIRTUAL_MACHINES_003",
		"status": false
	},
	{
		"name": "Ensure that DNSSEC is enabled for Cloud DNS",
		"description": "Cloud Domain Name System (DNS) is a fast, reliable and cost-effective domain name system that powers millions of domains on the internet. Domain Name System Security Extensions (DNSSEC) in Cloud DNS enables domain owners to take easy steps to protect their domains against DNS hijacking and man-in-the-middle and other attacks.",
		"testCaseId": "NETWORK_003",
		"status": false
	},
	{
		"name": "Ensure that SSH access is restricted from the internet",
		"description": "GCP Firewall Rules are specific to a VPC Network. Each rule either allows or denies traffic when its conditions are met. Its conditions allow the user to specify the type of traffic, such as ports and protocols, and the source or destination of the traffic, including IP addresses, subnets, and instances.\nFirewall rules are defined at the VPC network level and are specific to the network in which they are defined. The rules themselves cannot be shared among networks. Firewall rules only support IPv4 traffic. When specifying a source for an ingress rule or a destination for an egress rule by address, only an IPv4 address or IPv4 block in CIDR notation can be used. Generic (0.0.0.0/0) incoming traffic from the internet to VPC or VM instance using SSH on Port 22 can be avoided.",
		"testCaseId": "NETWORK_006",
		"status": false
	},
	{
		"name": "Ensure that RDP access is restricted from the Internet",
		"description": "GCP Firewall Rules are specific to a VPC Network. Each rule either allows or denies traffic when its conditions are met. Its conditions allow users to specify the type of traffic, such as ports and protocols, and the source or destination of the traffic, including IP addresses, subnets, and instances.\nFirewall rules are defined at the VPC network level and are specific to the network in which they are defined. The rules themselves cannot be shared among networks. Firewall rules only support IPv4 traffic. When specifying a source for an ingress rule or a destination for an egress rule by address, an IPv4 address or IPv4 block in CIDR notation can be used. Generic (0.0.0.0/0) incoming traffic from the Internet to a VPC or VM instance using RDP on Port 3389 can be avoided.",
		"testCaseId": "NETWORK_007",
		"status": false
	},
	{
		"name": "Ensure 'Block Project-wide SSH keys' is enabled for VM instances",
		"description": "It is recommended to use Instance specific SSH key(s) instead of using common/shared project-wide SSH key(s) to access Instances.",
		"testCaseId": "COMPUTE_VIRTUAL_MACHINES_002",
		"status": true
	},
	{
		"name": "Ensure 'Enable connecting to serial ports' is not enabled for VM Instance",
		"description": "Interacting with a serial port is often referred to as the serial console, which is similar to using a terminal window, in that input and output is entirely in text mode and there is no graphical interface or mouse support.\nIf you enable the interactive serial console on an instance, clients can attempt to connect to that instance from any IP address. Therefore interactive serial console support should be disabled.",
		"testCaseId": "COMPUTE_VIRTUAL_MACHINES_004",
		"status": true
	},
	{
		"name": "Ensure that the default network does not exist in a project",
		"description": "To prevent use of default network, a project should not have a default network.",
		"testCaseId": "NETWORK_001",
		"status": true
	}
]
